load_tests/results/20260508_110350/refresh-storm-test.log

         /\      Grafana   /ΓÇ╛ΓÇ╛/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ΓÇ╛ΓÇ╛\ 
  /          \   |   (  |  (ΓÇ╛)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: C:\Users\shaki\IdeaProjects\dragon-of-north\load_tests\refresh-storm-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 20 max VUs, 1m55s max duration (incl. graceful stop):
              * default: Up to 20 looping VUs for 1m25s over 4 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 01/20 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 01/20 VUs  0m01.0s/1m25.0s

running (0m02.0s), 01/20 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 01/20 VUs  0m02.0s/1m25.0s

running (0m03.0s), 02/20 VUs, 0 complete and 0 interrupted iterations
default   [   4% ] 02/20 VUs  0m03.0s/1m25.0s

running (0m04.0s), 02/20 VUs, 1 complete and 0 interrupted iterations
default   [   5% ] 02/20 VUs  0m04.0s/1m25.0s

running (0m05.0s), 03/20 VUs, 2 complete and 0 interrupted iterations
default   [   6% ] 03/20 VUs  0m05.0s/1m25.0s

running (0m06.0s), 03/20 VUs, 4 complete and 0 interrupted iterations
default   [   7% ] 03/20 VUs  0m06.0s/1m25.0s

running (0m07.0s), 04/20 VUs, 7 complete and 0 interrupted iterations
default   [   8% ] 04/20 VUs  0m07.0s/1m25.0s

running (0m08.0s), 04/20 VUs, 9 complete and 0 interrupted iterations
default   [   9% ] 04/20 VUs  0m08.0s/1m25.0s

running (0m09.0s), 05/20 VUs, 11 complete and 0 interrupted iterations
default   [  11% ] 05/20 VUs  0m09.0s/1m25.0s

running (0m10.0s), 05/20 VUs, 15 complete and 0 interrupted iterations
default   [  12% ] 05/20 VUs  0m10.0s/1m25.0s

running (0m11.0s), 06/20 VUs, 19 complete and 0 interrupted iterations
default   [  13% ] 06/20 VUs  0m11.0s/1m25.0s

running (0m12.0s), 06/20 VUs, 23 complete and 0 interrupted iterations
default   [  14% ] 06/20 VUs  0m12.0s/1m25.0s

running (0m13.0s), 07/20 VUs, 25 complete and 0 interrupted iterations
default   [  15% ] 07/20 VUs  0m13.0s/1m25.0s

running (0m14.0s), 07/20 VUs, 31 complete and 0 interrupted iterations
default   [  16% ] 07/20 VUs  0m14.0s/1m25.0s

running (0m15.0s), 07/20 VUs, 37 complete and 0 interrupted iterations
default   [  18% ] 07/20 VUs  0m15.0s/1m25.0s

running (0m16.0s), 08/20 VUs, 42 complete and 0 interrupted iterations
default   [  19% ] 08/20 VUs  0m16.0s/1m25.0s

running (0m17.0s), 09/20 VUs, 45 complete and 0 interrupted iterations
default   [  20% ] 09/20 VUs  0m17.0s/1m25.0s

running (0m18.0s), 09/20 VUs, 53 complete and 0 interrupted iterations
default   [  21% ] 09/20 VUs  0m18.0s/1m25.0s

running (0m19.0s), 10/20 VUs, 60 complete and 0 interrupted iterations
default   [  22% ] 10/20 VUs  0m19.0s/1m25.0s

running (0m20.0s), 10/20 VUs, 68 complete and 0 interrupted iterations
default   [  24% ] 10/20 VUs  0m20.0s/1m25.0s

running (0m21.0s), 11/20 VUs, 72 complete and 0 interrupted iterations
default   [  25% ] 11/20 VUs  0m21.0s/1m25.0s

running (0m22.0s), 12/20 VUs, 83 complete and 0 interrupted iterations
default   [  26% ] 12/20 VUs  0m22.0s/1m25.0s

running (0m23.0s), 12/20 VUs, 88 complete and 0 interrupted iterations
default   [  27% ] 12/20 VUs  0m23.0s/1m25.0s

running (0m24.0s), 13/20 VUs, 95 complete and 0 interrupted iterations
default   [  28% ] 13/20 VUs  0m24.0s/1m25.0s

running (0m25.0s), 13/20 VUs, 106 complete and 0 interrupted iterations
default   [  29% ] 13/20 VUs  0m25.0s/1m25.0s

running (0m26.0s), 14/20 VUs, 116 complete and 0 interrupted iterations
default   [  31% ] 14/20 VUs  0m26.0s/1m25.0s

running (0m27.0s), 15/20 VUs, 122 complete and 0 interrupted iterations
default   [  32% ] 15/20 VUs  0m27.0s/1m25.0s

running (0m28.0s), 15/20 VUs, 131 complete and 0 interrupted iterations
default   [  33% ] 15/20 VUs  0m28.0s/1m25.0s

running (0m29.0s), 16/20 VUs, 144 complete and 0 interrupted iterations
default   [  34% ] 16/20 VUs  0m29.0s/1m25.0s

running (0m30.0s), 16/20 VUs, 155 complete and 0 interrupted iterations
default   [  35% ] 16/20 VUs  0m30.0s/1m25.0s

running (0m31.0s), 17/20 VUs, 166 complete and 0 interrupted iterations
default   [  36% ] 17/20 VUs  0m31.0s/1m25.0s

running (0m32.0s), 18/20 VUs, 178 complete and 0 interrupted iterations
default   [  38% ] 18/20 VUs  0m32.0s/1m25.0s

running (0m33.0s), 18/20 VUs, 192 complete and 0 interrupted iterations
default   [  39% ] 18/20 VUs  0m33.0s/1m25.0s

running (0m34.0s), 19/20 VUs, 210 complete and 0 interrupted iterations
default   [  40% ] 19/20 VUs  0m34.0s/1m25.0s

running (0m35.0s), 19/20 VUs, 218 complete and 0 interrupted iterations
default   [  41% ] 19/20 VUs  0m35.0s/1m25.0s

running (0m36.0s), 20/20 VUs, 232 complete and 0 interrupted iterations
default   [  42% ] 20/20 VUs  0m36.0s/1m25.0s

running (0m37.0s), 20/20 VUs, 249 complete and 0 interrupted iterations
default   [  44% ] 20/20 VUs  0m37.0s/1m25.0s

running (0m38.0s), 20/20 VUs, 268 complete and 0 interrupted iterations
default   [  45% ] 20/20 VUs  0m38.0s/1m25.0s

running (0m39.0s), 20/20 VUs, 278 complete and 0 interrupted iterations
default   [  46% ] 20/20 VUs  0m39.0s/1m25.0s

running (0m40.0s), 20/20 VUs, 296 complete and 0 interrupted iterations
default   [  47% ] 20/20 VUs  0m40.0s/1m25.0s

running (0m41.0s), 20/20 VUs, 309 complete and 0 interrupted iterations
default   [  48% ] 20/20 VUs  0m41.0s/1m25.0s

running (0m42.0s), 20/20 VUs, 328 complete and 0 interrupted iterations
default   [  49% ] 20/20 VUs  0m42.0s/1m25.0s

running (0m43.0s), 20/20 VUs, 341 complete and 0 interrupted iterations
default   [  51% ] 20/20 VUs  0m43.0s/1m25.0s

running (0m44.0s), 20/20 VUs, 356 complete and 0 interrupted iterations
default   [  52% ] 20/20 VUs  0m44.0s/1m25.0s

running (0m45.0s), 20/20 VUs, 369 complete and 0 interrupted iterations
default   [  53% ] 20/20 VUs  0m45.0s/1m25.0s

running (0m46.0s), 20/20 VUs, 381 complete and 0 interrupted iterations
default   [  54% ] 20/20 VUs  0m46.0s/1m25.0s

running (0m47.0s), 20/20 VUs, 401 complete and 0 interrupted iterations
default   [  55% ] 20/20 VUs  0m47.0s/1m25.0s

running (0m48.0s), 20/20 VUs, 415 complete and 0 interrupted iterations
default   [  56% ] 20/20 VUs  0m48.0s/1m25.0s

running (0m49.0s), 20/20 VUs, 429 complete and 0 interrupted iterations
default   [  58% ] 20/20 VUs  0m49.0s/1m25.0s

running (0m50.0s), 20/20 VUs, 444 complete and 0 interrupted iterations
default   [  59% ] 20/20 VUs  0m50.0s/1m25.0s

running (0m51.0s), 20/20 VUs, 460 complete and 0 interrupted iterations
default   [  60% ] 20/20 VUs  0m51.0s/1m25.0s

running (0m52.0s), 20/20 VUs, 476 complete and 0 interrupted iterations
default   [  61% ] 20/20 VUs  0m52.0s/1m25.0s

running (0m53.0s), 20/20 VUs, 487 complete and 0 interrupted iterations
default   [  62% ] 20/20 VUs  0m53.0s/1m25.0s

running (0m54.0s), 20/20 VUs, 505 complete and 0 interrupted iterations
default   [  64% ] 20/20 VUs  0m54.0s/1m25.0s

running (0m55.0s), 20/20 VUs, 521 complete and 0 interrupted iterations
default   [  65% ] 20/20 VUs  0m55.0s/1m25.0s

running (0m56.0s), 20/20 VUs, 539 complete and 0 interrupted iterations
default   [  66% ] 20/20 VUs  0m56.0s/1m25.0s

running (0m57.0s), 20/20 VUs, 549 complete and 0 interrupted iterations
default   [  67% ] 20/20 VUs  0m57.0s/1m25.0s

running (0m58.0s), 20/20 VUs, 565 complete and 0 interrupted iterations
default   [  68% ] 20/20 VUs  0m58.0s/1m25.0s

running (0m59.0s), 20/20 VUs, 580 complete and 0 interrupted iterations
default   [  69% ] 20/20 VUs  0m59.0s/1m25.0s

running (1m00.0s), 20/20 VUs, 599 complete and 0 interrupted iterations
default   [  71% ] 20/20 VUs  1m00.0s/1m25.0s

running (1m01.0s), 20/20 VUs, 608 complete and 0 interrupted iterations
default   [  72% ] 20/20 VUs  1m01.0s/1m25.0s

running (1m02.0s), 20/20 VUs, 622 complete and 0 interrupted iterations
default   [  73% ] 20/20 VUs  1m02.0s/1m25.0s

running (1m03.0s), 20/20 VUs, 633 complete and 0 interrupted iterations
default   [  74% ] 20/20 VUs  1m03.0s/1m25.0s

running (1m04.0s), 20/20 VUs, 645 complete and 0 interrupted iterations
default   [  75% ] 20/20 VUs  1m04.0s/1m25.0s

running (1m05.0s), 20/20 VUs, 665 complete and 0 interrupted iterations
default   [  76% ] 20/20 VUs  1m05.0s/1m25.0s

running (1m06.0s), 20/20 VUs, 684 complete and 0 interrupted iterations
default   [  78% ] 20/20 VUs  1m06.0s/1m25.0s

running (1m07.0s), 20/20 VUs, 695 complete and 0 interrupted iterations
default   [  79% ] 20/20 VUs  1m07.0s/1m25.0s

running (1m08.0s), 20/20 VUs, 705 complete and 0 interrupted iterations
default   [  80% ] 20/20 VUs  1m08.0s/1m25.0s

running (1m09.0s), 20/20 VUs, 720 complete and 0 interrupted iterations
default   [  81% ] 20/20 VUs  1m09.0s/1m25.0s

running (1m10.0s), 20/20 VUs, 731 complete and 0 interrupted iterations
default   [  82% ] 20/20 VUs  1m10.0s/1m25.0s

running (1m11.0s), 20/20 VUs, 751 complete and 0 interrupted iterations
default   [  84% ] 20/20 VUs  1m11.0s/1m25.0s

running (1m12.0s), 19/20 VUs, 765 complete and 0 interrupted iterations
default   [  85% ] 19/20 VUs  1m12.0s/1m25.0s

running (1m13.0s), 18/20 VUs, 777 complete and 0 interrupted iterations
default   [  86% ] 18/20 VUs  1m13.0s/1m25.0s

running (1m14.0s), 16/20 VUs, 789 complete and 0 interrupted iterations
default   [  87% ] 16/20 VUs  1m14.0s/1m25.0s

running (1m15.0s), 15/20 VUs, 805 complete and 0 interrupted iterations
default   [  88% ] 15/20 VUs  1m15.0s/1m25.0s

running (1m16.0s), 13/20 VUs, 819 complete and 0 interrupted iterations
default   [  89% ] 13/20 VUs  1m16.0s/1m25.0s

running (1m17.0s), 12/20 VUs, 826 complete and 0 interrupted iterations
default   [  91% ] 12/20 VUs  1m17.0s/1m25.0s

running (1m18.0s), 11/20 VUs, 833 complete and 0 interrupted iterations
default   [  92% ] 11/20 VUs  1m18.0s/1m25.0s

running (1m19.0s), 10/20 VUs, 844 complete and 0 interrupted iterations
default   [  93% ] 10/20 VUs  1m19.0s/1m25.0s

running (1m20.0s), 07/20 VUs, 854 complete and 0 interrupted iterations
default   [  94% ] 07/20 VUs  1m20.0s/1m25.0s

running (1m21.0s), 06/20 VUs, 858 complete and 0 interrupted iterations
default   [  95% ] 06/20 VUs  1m21.0s/1m25.0s

running (1m22.0s), 06/20 VUs, 861 complete and 0 interrupted iterations
default   [  96% ] 06/20 VUs  1m22.0s/1m25.0s

running (1m23.0s), 04/20 VUs, 867 complete and 0 interrupted iterations
default   [  98% ] 04/20 VUs  1m23.0s/1m25.0s

running (1m24.0s), 02/20 VUs, 870 complete and 0 interrupted iterations
default   [  99% ] 02/20 VUs  1m24.0s/1m25.0s

running (1m25.0s), 02/20 VUs, 872 complete and 0 interrupted iterations
default   [ 100% ] 02/20 VUs  1m25.0s/1m25.0s

running (1m26.0s), 01/20 VUs, 873 complete and 0 interrupted iterations
default Γåô [ 100% ] 02/20 VUs  1m25s


  Γûê THRESHOLDS 

    refresh_latency
    Γ£ô 'p(95)<6000' p(95)=0
    Γ£ô 'avg<3500' avg=0


  Γûê TOTAL RESULTS 

    checks_total.......: 1748    20.265162/s
    checks_succeeded...: 100.00% 1748 out of 1748
    checks_failed......: 0.00%   0 out of 1748

    Γ£ô login returned a non-server-error status
    Γ£ô login produced expected status

    CUSTOM
    refresh_latency......: avg=0        min=0        med=0        max=0     p(90)=0        p(95)=0       

    HTTP
    http_req_duration....: avg=352.94ms min=293.72ms med=307.29ms max=2.38s p(90)=381.31ms p(95)=777.57ms
    http_req_failed......: 100.00% 874 out of 874
    http_reqs............: 874     10.132581/s

    EXECUTION
    iteration_duration...: avg=1.37s    min=1.29s    med=1.3s     max=4.43s p(90)=1.41s    p(95)=1.88s   
    iterations...........: 874     10.132581/s
    vus..................: 1       min=1          max=20
    vus_max..............: 20      min=20         max=20

    NETWORK
    data_received........: 817 kB  9.5 kB/s
    data_sent............: 304 kB  3.5 kB/s



running (1m26.3s), 00/20 VUs, 874 complete and 0 interrupted iterations
default Γ£ô [ 100% ] 00/20 VUs  1m25s